<?php

namespace App\Models;

use Illuminate\Database\Eloquent\Factories\HasFactory;
use Illuminate\Database\Eloquent\Model;

class TestModel
{
    public $about_project;
    public $project;

    public function __construct($name)
    {
        $this->project = array("Manheten" => array(
            "name_header" => "Будівництво громадського, торгівельно-офісного, житлового комплексу
                            з підземним та наземним паркінгом (будинок №3)",
            "img_project" => '../images/manheten.png',
            "name_project" => 'ЖК Manhattan city Київ, Шевченківський р-н',
            "info_about" => 'Перелік робіт, що виконуються власними силами зокрема головного пiдряду:
                            Влаштування монолітного залізобетонного каркасу в тому числі стилобатну пробудову,
                            цегляну кладку стін і перегородок, виготовлення та монтаж металоконструкці,
                            металовиробів.',
            "order" => "ТОВ «СТОЛИЧНИЙ БУДСОЮЗ» КАН",
            "adress" => "Перетин вул..Борщагівської та Повітрофлотського в
                                Шевченківському районі м.Києва"
        ), "Cardinal" => array(
            "name_header" => "Житловий, офісно-торгівельний комплекс з вбудованим закладом по роботі з дітьми",
            "img_project" => '../images/cardinal.jpg',
            "name_project" => 'ЖК Cardinal(Кардинал) вул. Анрі Барбюса, 28а',
            "info_about" => "ТЕП об’єкта: 47213м² \n
                             Виконуємо функції головного підрядника та власними силами: фундаментна плита,
                             монолітний з/б каркас будинку, внутрішні та зовнішні стіни, ектромонтажні роботи.
                             Різноманітні планувальні рішення об'єднані високими стандартами життєвого
        комфорту і розподілу простору.",
            "order" => "ТОВ «НВФ УКРБУДПРОЕКТ 1» GEOS",
            "adress" => "Київ, Нова Забудова, вул. Барбюса, 28-А\r\n
                         поблизу станції метро 'Палац 'Україна''"),
            "Vezha" => array(
                "name_header" => "Житлово-офісний комплекс з центром дозвілля та торгівлі, спортивно-оздоровчими
                приміщеннями та паркінгом",
                "img_project" => '../images/vezha.jpg',
                "name_project" => 'ЖК Печерська Вежа, Київ Печерський р-н',
                "info_about" => "ТЕП об’єкта: 63315 м²
                 Проєкт являє собою двосекційний 26-поверховий будинок з 5-поверховою стилобатною частиною.
                  На першому поверсі стилобату розмістилися супермаркет, магазини і сервіси, комерційні приміщення під офіси. \n
                  Генеральний підрядник власними силами: фундаментна плита, монолітний з/б каркас будинку,
                   внутрішні та зовнішні стіни.",
                "order" => "ТОВ «Гранд Луол»",
                "adress" => "Київ, Печерський район, Нижній Печерськ,
                             вул. Кіквідзе, 41 "));
        $this->about_project=$this->project[$name];
    }
}
